RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_usart.h
  USART_InitTypeDef             Init;             /*!< USART communication parameters      */

  uint8_t                       *pTxBuffPtr;      /*!< Pointer to USART Tx transfer Buffer */

  uint16_t                      TxXferSize;       /*!< USART Tx Transfer size              */

  __IO uint16_t                 TxXferCount;      /*!< USART Tx Transfer Counter           */

  uint8_t                       *pRxBuffPtr;      /*!< Pointer to USART Rx transfer Buffer */

  uint16_t                      RxXferSize;       /*!< USART Rx Transfer size              */

  __IO uint16_t                 RxXferCount;      /*!< USART Rx Transfer Counter           */

  uint16_t                      Mask;             /*!< USART Rx RDR register mask          */

  DMA_HandleTypeDef             *hdmatx;          /*!< USART Tx DMA Handle parameters      */

  DMA_HandleTypeDef             *hdmarx;          /*!< USART Rx DMA Handle parameters      */

  HAL_LockTypeDef               Lock;            /*!<  Locking object                      */

  __IO HAL_USART_StateTypeDef   State;           /*!< USART communication state           */

  __IO uint32_t                 ErrorCode;       /*!< USART Error code                    */

}USART_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup USART_Exported_Constants USART Exported Constants
  * @{
  */

/** @defgroup USART_Stop_Bits  USART Number of Stop Bits
  * @{
  */
#define USART_STOPBITS_0_5                  ((uint32_t)USART_CR2_STOP_0)                      /*!< USART frame with 0.5 stop bit  */
#define USART_STOPBITS_1                    ((uint32_t)0x00000000U)                           /*!< USART frame with 1 stop bit    */
#define USART_STOPBITS_1_5                  ((uint32_t)(USART_CR2_STOP_0 | USART_CR2_STOP_1)) /*!< USART frame with 1.5 stop bits */
#define USART_STOPBITS_2                    ((uint32_t)USART_CR2_STOP_1)                      /*!< USART frame with 2 stop bits   */
/**
  * @}
  */

/** @defgroup USART_Parity    USART Parity
  * @{
  */
#define USART_PARITY_NONE                   ((uint32_t)0x00000000U)                     /*!< No parity   */
#define USART_PARITY_EVEN                   ((uint32_t)USART_CR1_PCE)                   /*!< Even parity */
#define USART_PARITY_ODD                    ((uint32_t)(USART_CR1_PCE | USART_CR1_PS))  /*!< Odd parity  */
/**
  * @}
  */

/** @defgroup USART_Mode   USART Mode
  * @{
  */
#define USART_MODE_RX                       ((uint32_t)USART_CR1_RE)                   /*!< RX mode        */
#define USART_MODE_TX                       ((uint32_t)USART_CR1_TE)                   /*!< TX mode        */
#define USART_MODE_TX_RX                    ((uint32_t)(USART_CR1_TE |USART_CR1_RE))   /*!< RX and TX mode */
/**
  * @}
  */

/** @defgroup USART_Over_Sampling USART Over Sampling
  * @{
  */
#define USART_OVERSAMPLING_16               ((uint32_t)0x00000000U)         /*!< Oversampling by 16 */
#define USART_OVERSAMPLING_8                ((uint32_t)USART_CR1_OVER8)     /*!< Oversampling by 8  */
/**
  * @}
  */

/** @defgroup USART_Clock  USART Clock
  * @{
  */
#define USART_CLOCK_DISABLE                 ((uint32_t)0x00000000U)       /*!< USART clock disable */
#define USART_CLOCK_ENABLE                  ((uint32_t)USART_CR2_CLKEN)   /*!< USART clock enable  */
/**
  * @}
  */

/** @defgroup USART_Clock_Polarity  USART Clock Polarity
  * @{
  */
#define USART_POLARITY_LOW                  ((uint32_t)0x00000000U)      /*!< USART Clock signal is steady Low  */
#define USART_POLARITY_HIGH                 ((uint32_t)USART_CR2_CPOL)   /*!< USART Clock signal is steady High */
/**
  * @}
  */

/** @defgroup USART_Clock_Phase   USART Clock Phase
  * @{
  */
#define USART_PHASE_1EDGE                   ((uint32_t)0x00000000U)      /*!< USART frame phase on first clock transition  */
#define USART_PHASE_2EDGE                   ((uint32_t)USART_CR2_CPHA)   /*!< USART frame phase on second clock transition */
/**
  * @}
  */

/** @defgroup USART_Last_Bit  USART Last Bit
  * @{
  */
#define USART_LASTBIT_DISABLE               ((uint32_t)0x00000000U)      /*!< USART frame last data bit clock pulse not output to SCLK pin */
#define USART_LASTBIT_ENABLE                ((uint32_t)USART_CR2_LBCL)   /*!< USART frame last data bit clock pulse output to SCLK pin     */
/**
  * @}
  */

/** @defgroup USART_Prescaler  USART Prescaler
  * @{
  */
#define USART_PRESCALER_DIV1    ((uint32_t)0x00000000U)  /*!< USART clock /1   */
#define USART_PRESCALER_DIV2    ((uint32_t)0x00000001U)  /*!< USART clock /2   */
#define USART_PRESCALER_DIV4    ((uint32_t)0x00000002U)  /*!< USART clock /4   */
#define USART_PRESCALER_DIV6    ((uint32_t)0x00000003U)  /*!< USART clock /6   */
#define USART_PRESCALER_DIV8    ((uint32_t)0x00000004U)  /*!< USART clock /8   */
#define USART_PRESCALER_DIV10   ((uint32_t)0x00000005U)  /*!< USART clock /10  */
#define USART_PRESCALER_DIV12   ((uint32_t)0x00000006U)  /*!< USART clock /12  */
#define USART_PRESCALER_DIV16   ((uint32_t)0x00000007U)  /*!< USART clock /16  */
#define USART_PRESCALER_DIV32   ((uint32_t)0x00000008U)  /*!< USART clock /32  */
#define USART_PRESCALER_DIV64   ((uint32_t)0x00000009U)  /*!< USART clock /64  */
#define USART_PRESCALER_DIV128  ((uint32_t)0x0000000AU)  /*!< USART clock /128 */
#define USART_PRESCALER_DIV256  ((uint32_t)0x0000000BU)  /*!< USART clock /256 */

/**
  * @}
  */

/** @defgroup USART_Slave_Select_management USART Slave Select Management
  * @{
  */
#define USART_NSS_HW    ((uint32_t)0x00000000U)       /*!< USART Hardware NSS management */
#define USART_NSS_SW    ((uint32_t)USART_CR2_DIS_NSS) /*!< USART Software NSS management */
/**
  * @}
  */

/** @defgroup USART_Slave_Mode USART Synchronous Slave mode enable
  * @{
  */
#define USART_SLAVEMODE_DISABLE   ((uint32_t)0x00000000U)     /*!< USART SPI Slave Mode Enable  */
#define USART_SLAVEMODE_ENABLE    ((uint32_t)USART_CR2_SLVEN) /*!< USART SPI Slave Mode Disable */
/**
  * @}
  */


