RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_usart.h
 /** @defgroup USART_FIFO_mode USART FIFO mode
   * @brief    USART FIFO  mode
   * @{
   */
#define USART_FIFOMODE_DISABLE        ((uint32_t)0x00000000U)       /*!< FIFO mode disable */
#define USART_FIFOMODE_ENABLE         ((uint32_t)USART_CR1_FIFOEN)  /*!< FIFO mode enable  */
/**
  * @}
  */

/** @defgroup USART_TXFIFO_threshold_level USART TXFIFO threshold level
  * @brief    USART TXFIFO level
  * @{
  */
#define USART_TXFIFO_THRESHOLD_1_8    ((uint32_t)0x00000000U)                               /*!< TXFIFO reaches 1/8 of its depth */
#define USART_TXFIFO_THRESHOLD_1_4    ((uint32_t)USART_CR3_TXFTCFG_0)                       /*!< TXFIFO reaches 1/4 of its depth */
#define USART_TXFIFO_THRESHOLD_1_2    ((uint32_t)USART_CR3_TXFTCFG_1)                       /*!< TXFIFO reaches 1/2 of its depth */
#define USART_TXFIFO_THRESHOLD_3_4    ((uint32_t)(USART_CR3_TXFTCFG_0|USART_CR3_TXFTCFG_1)) /*!< TXFIFO reaches 3/4 of its depth */
#define USART_TXFIFO_THRESHOLD_7_8    ((uint32_t)USART_CR3_TXFTCFG_2)                       /*!< TXFIFO reaches 7/8 of its depth */
#define USART_TXFIFO_THRESHOLD_8_8    ((uint32_t)(USART_CR3_TXFTCFG_2|USART_CR3_TXFTCFG_0)) /*!< TXFIFO becomes empty            */
/**
  * @}
  */

/** @defgroup USART_RXFIFO_threshold_level USART RXFIFO threshold level
  * @brief    USART RXFIFO level
  * @{
  */
#define USART_RXFIFO_THRESHOLD_1_8    ((uint32_t)0x00000000U)                               /*!< RXFIFO reaches 1/8 of its depth */
#define USART_RXFIFO_THRESHOLD_1_4    ((uint32_t)USART_CR3_RXFTCFG_0)                       /*!< RXFIFO reaches 1/4 of its depth */
#define USART_RXFIFO_THRESHOLD_1_2    ((uint32_t)USART_CR3_RXFTCFG_1)                       /*!< RXFIFO reaches 1/2 of its depth */
#define USART_RXFIFO_THRESHOLD_3_4    ((uint32_t)(USART_CR3_RXFTCFG_0|USART_CR3_RXFTCFG_1)) /*!< RXFIFO reaches 3/4 of its depth */
#define USART_RXFIFO_THRESHOLD_7_8    ((uint32_t)USART_CR3_RXFTCFG_2)                       /*!< RXFIFO reaches 7/8 of its depth */
#define USART_RXFIFO_THRESHOLD_8_8    ((uint32_t)(USART_CR3_RXFTCFG_2|USART_CR3_RXFTCFG_0)) /*!< RXFIFO becomes full             */
/**
  * @}
  */

/** @defgroup USART_Request_Parameters  USART Request Parameters
  * @{
  */
#define USART_RXDATA_FLUSH_REQUEST        ((uint32_t)USART_RQR_RXFRQ)        /*!< Receive Data flush Request  */
#define USART_TXDATA_FLUSH_REQUEST        ((uint32_t)USART_RQR_TXFRQ)        /*!< Transmit data flush Request */
/**
  * @}
  */

/** @defgroup USART_Flags      USART Flags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the ISR register
  * @{
  */
#define USART_FLAG_TXFT                      USART_ISR_TXFT    /*!< USART TXFIFO threshold flag            */
#define USART_FLAG_RXFT                      USART_ISR_RXFT    /*!< USART RXFIFO threshold flag            */
#define USART_FLAG_RXFF                      USART_ISR_RXFF    /*!< USART RXFIFO Fullflag                  */
#define USART_FLAG_TXFE                      USART_ISR_TXFE    /*!< USART TXFIFO Empty flag                */
#define USART_FLAG_REACK                     USART_ISR_REACK   /*!< USART receive enable acknowledge flag  */
#define USART_FLAG_TEACK                     USART_ISR_TEACK   /*!< USART transmit enable acknowledge flag */
#define USART_FLAG_BUSY                      USART_ISR_BUSY    /*!< USART busy flag                        */
#define USART_FLAG_UDR                       USART_ISR_UDR     /*!< USART SPI slave underrun error         */
#define USART_FLAG_LBDF                      USART_ISR_LBDF    /*!< USART LIN break detection flag         */
#define USART_FLAG_TXE                       USART_ISR_TXE     /*!< USART transmit data register empty     */
#define USART_FLAG_TXFNF                     USART_ISR_TXE     /*!< USART TXFIFO not full                  */
#define USART_FLAG_TC                        USART_ISR_TC      /*!< USART transmission complete            */
#define USART_FLAG_RXNE                      USART_ISR_RXNE    /*!< USART read data register not empty     */
#define USART_FLAG_RXFNE                     USART_ISR_RXNE    /*!< USART RXFIFO not empty                 */
#define USART_FLAG_IDLE                      USART_ISR_IDLE    /*!< USART idle flag                        */
#define USART_FLAG_ORE                       USART_ISR_ORE     /*!< USART overrun error                    */
#define USART_FLAG_NE                        USART_ISR_NE      /*!< USART noise error                      */
#define USART_FLAG_FE                        USART_ISR_FE      /*!< USART frame error                      */
#define USART_FLAG_PE                        USART_ISR_PE      /*!< USART parity error                     */
/**
  * @}
  */

/** @defgroup USART_Interrupt_definition USART Interrupts Definition
  *        Elements values convention: 0000ZZZZ0XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *           - ZZZZ  : Flag position in the ISR register(5bits instead of 4bits)
  * @{
  */

#define USART_IT_PE                          ((uint16_t)0x0028U)
#define USART_IT_TXE                         ((uint16_t)0x0727U)
#define USART_IT_TC                          ((uint16_t)0x0626U)
#define USART_IT_RXNE                        ((uint16_t)0x0525U)
#define USART_IT_IDLE                        ((uint16_t)0x0424U)
#define USART_IT_ERR                         ((uint16_t)0x0060U)
#define USART_IT_RXFF                        ((uint16_t)0x183FU)
#define USART_IT_TXFE                        ((uint16_t)0x173EU)
#define USART_IT_RXFT                        ((uint16_t)0x1A7CU)
#define USART_IT_TXFT                        ((uint16_t)0x1B77U)

#define USART_IT_UDR                         ((uint16_t)0x0D00U)
#define USART_IT_ORE                         ((uint16_t)0x0300U)
#define USART_IT_NE                          ((uint16_t)0x0200U)
#define USART_IT_FE                          ((uint16_t)0x0100U)
/**
  * @}
  */

